Revit 2020 API
SpotDimension.SpotDimensionType Property
 The dimension style of this dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public SpotDimensionType SpotDimensionType { get; set; }
Visual Basic
Public Property SpotDimensionType As SpotDimensionType
	Get
	Set
Visual C++
public:
property SpotDimensionType^ SpotDimensionType {
	SpotDimensionType^ get ();
	void set (SpotDimensionType^ value);
}
See Also
SpotDimension Class
Autodesk.Revit.DB Namespace